IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM29_CONTROLSS_G2_EPWM29.xml
	<register id="CONTROLSS_G2_EPWM29_CMPCTL2" acronym="CONTROLSS_G2_EPWM29_CMPCTL2" offset="0x12" width="16" description="Counter Compare Control Register 2">
		<bitfield id="LOADDSYNC" width="2" begin="13" end="12" resetval="0x0" description="Shadow to Active CMPD Register Load on SYNC event   00: Shadow to Active Load of CMPD occurs according to LOADDMODE  01: Shadow to Active Load of CMPD occurs both according to LOADDMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPD occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWDMODE] = 0." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="LOADCSYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active CMPC Register Load on SYNC event   00: Shadow to Active Load of CMPC occurs according to LOADCMODE  01: Shadow to Active Load of CMPC occurs both according to LOADCMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPC occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWCMODE] = 0." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="SHDWDMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-Compare D Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWCMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-Compare C Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="4" rwaccess="R/W"/> 
		<bitfield id="LOADDMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare D [CMPD] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADCMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare C [CMPC] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM29_DBCTL" acronym="CONTROLSS_G2_EPWM29_DBCTL" offset="0x18" width="16" description="Dead-Band Generator Control Register">
		<bitfield id="HALFCYCLE" width="1" begin="15" end="15" resetval="0x0" description="Half Cycle Clocking Enable Bit   0: Full cycle clocking enabled. The dead-band counters are clocked at the TBCLK rate.  1: Half cycle clocking enabled. The dead-band counters are clocked at TBCLK*2." range="15" rwaccess="R/W"/> 
		<bitfield id="DEDB_MODE" width="1" begin="14" end="14" resetval="0x0" description="Dead Band Dual-Edge B Mode Control [S8 switch]   0: Rising edge delay applied to InA/InB as selected by S4 switch [IN-MODE bits] on A signal path only. Falling edge delay applied to InA/InB as selected by S5 switch [INMODE bits] on B signal path only.  1: Rising edge delay and falling edge delay applied to source selected by S4 switch [INMODE bits] and output to B signal path only. Note: When this bit is set to 1, user should always either set OUT_MODE bits such that Apath = InA OR OUTSWAP bits such that OutA=Bpath  otherwise, OutA will be invalid." range="14" rwaccess="R/W"/> 
		<bitfield id="OUTSWAP" width="2" begin="13" end="12" resetval="0x0" description="Dead Band Output Swap Control  Bit 13 controls the S6 switch and bit 12 controls the S7 switch.   00: OutA and OutB signals are as defined by OUT-MODE bits.  01: OutA = A-path as defined by OUT-MODE bits.  OutB = A-path as defined by OUT-MODE bits [rising edge delay or delay-bypassed A signal path].  10: OutA = B-path as defined by OUT-MODE bits [falling edge delay or delay-bypassed B signal path].  OutB = B-path as defined by OUT-MODE bits.  11: OutA = B-path as defined by OUT-MODE bits [falling edge delay or delay-bypassed B signal path].  OutB = A-path as defined by OUT-MODE bits [rising edge delay or delay-bypassed A signal path]." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="SHDWDBFEDMODE" width="1" begin="11" end="11" resetval="0x0" description="FED Dead-Band Load Mode   0: Immediate mode. Only the active DBFED register is used. All writes/reads via the CPU directly access the active register for immediate FED dead-band action.  1: Shadow mode. Operates as a double buffer. All writes via the CPU access Shadow register. Default at Reset is Immediate mode [for compatibility with legacy]." range="11" rwaccess="R/W"/> 
		<bitfield id="SHDWDBREDMODE" width="1" begin="10" end="10" resetval="0x0" description="RED Dead-Band Load Mode   0: Immediate mode. Only the active DBRED register is used. All writes/reads via the CPU directly access the active register for immediate RED dead-band action.  1: Shadow mode. Operates as a double buffer. All writes via the CPU access Shadow register. Default at Reset is Immediate mode [for compatibility with legacy]." range="10" rwaccess="R/W"/> 
		<bitfield id="LOADFEDMODE" width="2" begin="9" end="8" resetval="0x0" description="Active DBFED Load from Shadow Select Mode   00: Load on Counter = 0 [CNT_eq]  01: Load on Counter = Period [PRD_eq]  10: Load on either Counter = 0, or Counter = Period  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="LOADREDMODE" width="2" begin="7" end="6" resetval="0x0" description="Active DBRED Load from Shadow Select Mode   00: Load on Counter = 0 [CNT_eq]  01: Load on Counter = Period [PRD_eq]  10: Load on either Counter = 0, or Counter = Period  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="IN_MODE" width="2" begin="5" end="4" resetval="0x0" description="Dead-Band Input Mode Control  Bit 5 controls the S5 switch and bit 4 controls the S4 switch shown. This allows you to select the input source to the falling-edge and rising-edge delay. To produce classical dead-band waveforms the default is EPWMxA In is the source for both falling and rising-edge delays.   00: EPWMxA In [from the action-qualifier] is the source for both falling-edge and rising-edge delay.  01: EPWMxB In [from the action-qualifier] is the source for rising-edge delayed signal.  EPWMxA In [from the action-qualifier] is the source for falling-edge delayed signal.  10: EPWMxA In [from the action-qualifier] is the source for rising-edge delayed signal.  EPWMxB In [from the action-qualifier] is the source for falling-edge delayed signal.  11: EPWMxB In [from the action-qualifier] is the source for both rising-edge delay and falling-edge delayed signal." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="POLSEL" width="2" begin="3" end="2" resetval="0x0" description="Polarity Select Control  Bit 3 controls the S3 switch and bit 2 controls the S2 switch. This allows you to selectively invert one of the delayed signals before it is sent out of the dead-band submodule. The following descriptions correspond to classical upper/lower switch control as found in one leg of a digital motor control inverter. These assume that DBCTL[OUT_MODE] = 1,1 and DBCTL[IN_MODE] = 0x0. Other enhanced modes are also possible, but not regarded as typical usage modes.   00: Active high [AH] mode. Neither EPWMxA nor EPWMxB is inverted [default].  01: Active low complementary [ALC] mode. EPWMxA is inverted.  10: Active high complementary [AHC]. EPWMxB is inverted.  11: Active low [AL] mode. Both EPWMxA and EPWMxB are inverted." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="OUT_MODE" width="2" begin="1" end="0" resetval="0x0" description="Dead-Band Output Mode Control  Bit 1 controls the S1 switch and bit 0 controls the S0 switch.   00: DBM is fully disabled or by-passed. In this mode the POLSEL and IN-MODE bits have no effect.  01: Apath = InA [delay is by-passed for A signal path]  Bpath = FED [Falling Edge Delay in B signal path]  10: Apath = RED [Rising Edge Delay in A signal path]  Bpath = InB [delay is by-passed for B signal path]  11: DBM is fully enabled [i.e. both RED and FED active]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM29_DBCTL2" acronym="CONTROLSS_G2_EPWM29_DBCTL2" offset="0x1A" width="16" description="Dead-Band Generator Control Register 2">
		<bitfield id="SHDWDBCTLMODE" width="1" begin="2" end="2" resetval="0x0" description="DBCTL Load Mode   0: Immediate mode - only the Active DBCTL register is used. All writes/reads via the CPU directly access the Active register.  1: Shadow mode - All writes and reads to bits [5:0] of the DBCTL register are shadowed. All other bits still access the active register." range="2" rwaccess="R/W"/> 
		<bitfield id="LOADDBCTLMODE" width="2" begin="1" end="0" resetval="0x0" description="Active DBCTL Load from Shadow Select Mode   00: Load on Counter = 0 [CNT_eq]  01: Load on Counter = Period [PRD_eq]  10: Load on either Counter = 0, or Counter = Period  11: Freeze [no loads possible]  Note: has no effect in Immediate mode" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM29_AQCTL" acronym="CONTROLSS_G2_EPWM29_AQCTL" offset="0x20" width="16" description="Action Qualifier Control Register">
		<bitfield id="LDAQBSYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active AQCTLB Register Load on SYNC event   00: Shadow to Active Load of AQCTLB occurs according to LDAQBMODE  01: Shadow to Active Load of AQCTLB occurs both according to LDAQBMODE bits and when SYNC occurs.  10: Shadow to Active Load of AQCTLB occurs only when a SYNC is received.  11: Reserved  Note: This bit is valid only if AQCTL[SHDWAQBMODE] = 1." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="LDAQASYNC" width="2" begin="9" end="8" resetval="0x0" description="Shadow to Active AQCTLA Register Load on SYNC event   00: Shadow to Active Load of AQCTLA occurs according to LDAQAMODE  01: Shadow to Active Load of AQCTLA occurs both according to LDAQAMODE bits and when SYNC occurs.  10: Shadow to Active Load of AQCTLA occurs only when a SYNC is received.  11: Reserved  Note: This bit is valid only if AQCTL[SHDWAQAMODE] = 1." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SHDWAQBMODE" width="1" begin="6" end="6" resetval="0x0" description="Action Qualifier B Register operating mode   1: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  0: Immediate mode - only the Active action qualifier register is used. All writes/reads via the CPU directly access the Active register." range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWAQAMODE" width="1" begin="4" end="4" resetval="0x0" description="Action Qualifier A Register operating mode   1: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  0: Immediate mode - only the Active action qualifier register is used. All writes/reads via the CPU directly access the Active register." range="4" rwaccess="R/W"/> 
		<bitfield id="LDAQBMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Action Qualifier B Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LDAQAMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Action Qualifier A Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: has no effect in Immediate mode." range="1 - 0" rwaccess="R/W"/>
	</register>
